{"Category": ["Top", "Top"], "Flair": ["[R]eddiquette", "/r/all"], "Score": [19709, 18243], "Title": ["Will donate thrice the number of upvotes (amount in Rs.) i get for this thread in next 24 hours", "Indian reply to NYtimes cartoon on Paris climate accord by Satish Acharya."], "Body": [">**Note**: If you want to know what this is all about, and how rains can cause so much damage, read this amazing in depth write-up by /u/fdsn (It covers all the basics for those who are new to this topic as well) ----> \n\n>https://www.reddit.com/r/india/comments/981o7s/will_donate_thrice_the_number_of_upvotes_amount/e4d2pl5/\n\n>also check the stickied comment for more info.\n\n\n\n\n**donation links** - \n\n* https://donation.cmdrf.kerala.gov.in/\n\n* **Paytm** link since they are matching the donations - \n\n      https://paytm.com/helpinghand/kerala-cm-s-distress-relief-fund.\n\n* Those who are queasy about donating cash can easily **donate goods through amazon** - \n\n    https://www.amazon.in/b?ie=UTF8&node=8891257031\n\n>.\n\n>.\n\n**PS:** https://www.youtube.com/watch?v=WaaANll8h18  \n\nor  \n\nhttps://www.youtube.com/watch?v=AeZ6a1A0-ow\n\n\nPSS: im ~~druk~~ drunk  duh! but wont regret it\n\nedit: damn! this blew up :) just woke up and dont worry i will donate. ~~should i donate some now or wait for 24 hours to complete?~~\n \n\nedit2: ...\n\nedit3 : ....\n\n**edit4** : since the web portal was keep timing out **i decided to donate by 'quick transfer' of sbi net banking into the CMDRF directly. the limit is 10000/day so i donated 10,000rs. rest will be donated tomorrow.**\n\n**proof** - https://i.imgur.com/H9S9DGG.jpg\n\n**edit5:   donated 25000 rs this morning -**\n\n**proof** - https://i.imgur.com/9PYqzSZ.jpg\n\n\n**total amount donated (by me) so for - 500+900+10000+69+25000= 36469 rs ($522).**\n\n\n**A big shout out to the great folks of /r/india  who generously  donated much more than this stupid thread goal.** always remember, every paisa counts. \n\n***Final edit -***  \n\n[ **I do declare ...bankruptcy!** :\\)](https://www.youtube.com/watch?v=C-m3RtoguAQ&feature=youtu.be&t=1m05s)\n\n", ""], "Link": ["https://www.reddit.com/r/india/comments/981o7s/will_donate_thrice_the_number_of_upvotes_amount/", "http://imgur.com/a/U48v9"], "NoOfComments": [838, 1503], "Comment1": ["**Update:** Since this thread has gone off the front page of /r/India, I posted a part II sort of thread. Please continue here - https://www.reddit.com/r/india/comments/98j4po/kerala_floods_informationhelpdonations_megathread/\n\n#Verified donations so far ~INR 700K\n\n\n#Huge shout out to all donors! This is brilliant! Couple of updates:\n\n1. Dear /u/TheBeginnerr, you have donated enough. Don't bankrupt yourself. The rest of us can continue contributions. No one will think any less of you if you didn't match exact 3x of upvotes.\n\n2. If you post screenshot of your donation (please make sure you hide personal details, transaction ID, bank details etc.) then /u/root_su will gild you. Just our way of saying thanks. We know donating to the cause has higher precedence right now. This is gold credit he already has. Not buying gold right now. \n\n3. If you have medium of donation that works well for people currently outside India, then please share as a reply to this comment (and tag me). I will update this comment.\n\n\n---\n\n**Context:** More than 324 people have died in the worst flooding in nearly a century in the south Indian state of Kerala.\n\nRoads are damaged, mobile phone networks are down, an international airport has been closed and more than 220,000 people have been left homeless after unusually heavy rain in the past nine days.\n\nOfficials repeatedly revised the death toll upwards from 86 people on Friday morning to more than 300 by the evening as a massive rescue operation reached more flood-hit regions. “Around 100 people died in the last 36 hours alone,” a state official said.\n\nCasualty numbers are expected to increase further, with thousands more people still stranded and less intense though still heavy rain forecast for at least the next 24 hours. Many have died from being buried in hundreds of landslides set off by the flooding. ([Source](https://www.theguardian.com/world/2018/aug/17/kerala-floods-death-toll-rescue-effort-india))\n\n\n###Donation link: https://donation.cmdrf.kerala.gov.in/\n\nThe donation link goes awol from time to time. Here is the bank details if you want to do direct transfer:\n\nAccount Number : 67319948232  \nBranch : City Branch, Thiruvananthapuram  \nIFSC : SBIN0070028  \nPAN: AAAGD0584M  \nAccount Type: Savings  \nSWIFT CODE : SBININBBT08  \nName of Donee:   \nChief Ministers Distress Relief Fund\nAddress :Govt of Kerala  \nDistrict: Thiruvananthapuram  \nState Kerala  \nPin 695001  \n\n#Other donation methods:\n\n* Donate through Amazon: https://www.amazon.in/b?ie=UTF8&node=8891257031\nFrom this page you can choose to donate through three NGOs.\n\n\n\n\n\n#Other Ways to Help\n\n* [Young Indians CII with Rotary and the District Administration is looking to procure and send material as requested, see thread for details](https://www.reddit.com/r/bangalore/comments/97qitf/relief_operations_for_kerela_floods_please/)\n* [keralarescue.in (govt. website) is need of Django developers](https://np.reddit.com/r/india/comments/97p5qn/np_please_help_rescuekeralain_needs_django/)\n\n---\n\n**Arm chair lawyers read this:** We do not condone karma whoring. But. Butt. But, this post is infinitely more useful than the 'oh look at this pretty photo (I took or I lifted from the internet)' threads. And about admins, yeah, they need to focus on cleaning reddit and get rid of hateful fucks that pose actual threat against people. They should focus on subs dedicated on harassing people. They should focus on subs accommodating and/or encouraging bigotry in the guise of free speech and/or dark humor. This harmless post, an attempt at raising awareness towards actual suffering of actual people should be fine. It ought to be anyway. </rant>\n\n\n###edit n: Bears. Beets. Battlestar Galactica.\n\n", "Hello users from /r/all. This is just a reminder that this is /r/india, so if you're participating here you're encouraged to follow the rules on the sidebar.   \n  \nHere [is the original cartoon](https://www.nytimes.com/2015/12/07/opinion/india-at-the-paris-climate-conference.html) by the New York Times.   \n  \n---Edit--- \n  \nWant to see user reports on this post, /r/india subscribers? I think this post (actually shitting on the NYT) has triggered Trump supporters for reasons unknown to me  \n  \nuser reports:   \n9: Not about India(ns)           \n5: Spam            \n5: <no reason>          \n3: Breaking reddit             \n3: Personal attacks | Abuse | Hate mongering          \n2: Submission not in English         \n2: POO IN LOO        \n1: Are you sure the poo isn't Indian       \n1: This must be lots of work mods. Hope you have good weekend!   \n1: trumpets getting rekt at home and overseas   \n1: WAGONWHEEL           \n1: Should draw a picture of your entire country shitting on a street, blocking cars from going to work   \n1: shitting streets, epic corruption, superbug breeding & 1 billion people, you don't get to whine ever   \n1: shit shit shit shit shit shit shit shit your country is shit shit shit             \n1: tfw India has never been relevant on the political world stage and never will be   \n1: Rapist country   \n1: No one cares about your 3rd world nation.   \n1: poo in loo   \n1: TIL rule violation   \n1: He's shitting in the streets, just like your entire country, Pajeet!         \n  \nUser reports to my comment:  \n  \n1: Porn/Gore/NSFW | Self Promotion          \n1: Not Verified and Reputed Content            \n1: DESIGNATED INDIAN RAPING STREETS           \n1: Hi!            \n1: tfw white people will be second-class citizens in 30 yrs and will know true suffering      \n1: all brown people are smelly         \n1: Spam          \n1: PM_Me_Yo_Tits_Grrl wants to be included too          \n1: Send nudes              \n1: Being a smelly brown person.          \n1: politics are killing reddit Personal attacks | Abuse | Hate mongering         \n1: Oh boy! This is my time to shine and say something funny!            \n1: I think you're a nice dude but you can't prove whether you're smelly or not over the internet liar.         \n1: Involuntary pornography           \n1: look at me I'm the center of attention now              \n1: I think you are beautiful and smell like butterflies                \n  \nFYI I'm not that smelly. "], "Comment2": ["I'll match your donation, OP\n\nEDIT: Woke up to see this rapidly went out of my *aukaat*, so [here's my meager donation to the cause](https://imgur.com/a/CJykel3). I hope my brothers and sisters from Kerala can forgive me. \n\nAs compensation, I'm going to spend the rest of today and tomorrow volunteering in the collection drives around Hyderabad. If anyone is in town, do come by and drop off anything you can spare. Packaged food, blankets, sanitary pads, and of course water bottles. They never have enough water during the floods. I remember how there were people charging 1000 rupees a bottle during the Uttarakhand floods. \n\nI will also be asking my friends to donate as much as they can. Cheers and I hope the storm blows over quickly. ", "Everytime NYT depicts India badly, it gets backfired so hard.  \n\n[This isn't their 1st time](http://i.imgur.com/nYD6Phn.jpg) \n\nedit: Imgur link  "], "Comment3": ["Was hoping to match OP's amount, but this is fast going out of my *aukaat*. So here's my contribution: https://i.imgur.com/R7E3btm.png\n\nGodspeed, OP!", "American here. Just wanted to say to India: I'm sorry we were such dicks back then. What y'all have done in the years since has been nothing short of astonishing. Please continue to lead the way on renewables. "], "Comment4": ["I want to support my Indian friends but they don’t take my German credit card :(\n\nDone! It’s not much since I’m an average German student (and Jnu alumnus) without much cash\n\nhttps://i.imgur.com/WiwEWdF.jpg", "[Fixed](http://imgur.com/8wV4C40.jpg)"], "Comment5": ["Seeing people donating in such large amount.   \n\nI am feeling guilty of paying just 101 as I can't afford more than that currently. ", "[deleted]"], "Comment6": ["I pledge to donate at least 10 times the amount of upvotes you get for the post (not this comment). Will wait for a couple days to get the final number.\n\nWill post proof once done.\n\nEdit: [Proof](https://i.imgur.com/s84vq7w.jpg) for the first ₹100,000.", "Asli masala controversial me hai"], "Comment7": ["Inspired by your post just donated [INR 5000](https://imgur.com/a/C3fIjpe)", "All American media is overall anti India in its reporting.. They bully India for any agreement that hits a snag coz India refused to ratify before understanding India's reasoning for their decision. \n\nHypocrites "], "Comment8": ["I wanted to give you Gold for this post but I donated that amount to Kerala. I advise everyone to spend the money where's it's needed the most. Right now it's Kerala.", "[removed]"], "Comment9": ["Will match twice the number of upvotes for OP's post (in Rs) in next 24 hours \nEdit: \nPace of upvotes got scary....\nChickened out at 7.5k upvotes\nProof:\nhttps://imgur.com/WXW4VxJ", "Hello, I'm from Canada and have met and worked with many great Indo-Canadians over the years. Saw this thread and figured I'd stop by and spread some love by saying how great I think the Indo-Canadian community has been for this country. "], "Comment10": ["I'll donate thrice number of upvotes my this comment gets", "This comic is so blatantly offensive!\n\n...Elephants are far more intelligent than trump!"], "TimeStamp": ["2018-08-18 01:32:17", "2017-06-04 02:17:25"], "Username": ["TheBeginnerr", "spikyraccoon"]}